# -------------------------------------
# Utilities
# -------------------------------------
# best shell in the world
brew "fish"
# fuzzy finder — sourced unconditionally in config.fish
brew "fzf"
# task runner — used by the justfile in this repo
brew "just"
# better `ls`
brew "lsd"
brew "ripgrep"
brew "wget"
# terminal multiplexer (tmux replacement)
brew "zellij"

# -------------------------------------
# Dev tools
# -------------------------------------
cask "font-fira-code-nerd-font"
brew "awscli"
brew "git"
brew "nvm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
# referenced in config.fish (init wrapped in `type -q` guard)
brew "rbenv"
brew "sqlite"
brew "vim"

# -------------------------------------
# Editors
# -------------------------------------
cask "zed"

# -------------------------------------
# Personal homebrew repo
# -------------------------------------
tap "a5huynh/brew"
